<?php

$lang['required']			= "الحقل %s مطلوب.";
$lang['isset']				= "الحقل %s يجب ان يحتوي على قيمة.";
$lang['valid_email']		= "الحقل %s يجب ان يحتوي على عنوان بريدي صحيح.";
$lang['valid_emails']		= "الحقل %s يحتوي على عناوين بريدية صحيحة.";
$lang['valid_url']			= "الحقل %s يجب ان يحتوي على عنوان موقع صالح.";
$lang['valid_ip']			= "الحقل %s يجب ان يحتوي على اي بي صحيح.";
$lang['min_length']			= "الحقل %s يحب على الاقل ان يحتوي على %s حرفاً في الطول.";
$lang['max_length']			= "لايمكن ان يتجاوز الحقل %s اكثر من %s حرفاً في الطول.";
$lang['exact_length']		= "يجب ان يحتوي الحقل %s على %s حرفاً بالضبط في الطول.";
$lang['alpha']				= "قد يحتوي الحقل %s على الحروف الأبجدية فقط.";
$lang['alpha_numeric']		= "قد يحتوي الحقل %s على أحرف أبجدية رقمية فقط.";
$lang['alpha_dash']			= "الحقل %s قد يحتوي فقط على أحرف أبجدية رقمية ، علامة سفلية ، وشرطات.";
$lang['numeric']			= "الحقل %s يجب أن تحتوي على أرقام فقط.";
$lang['is_numeric']			= "يجب أن يحتوي الحقل %s على أحرف رقمية فقط.";
$lang['integer']			= "يجب أن يحتوي الحقل %s على عدد صحيح.";
$lang['regex_match']		= "الحقل %s ليس في التنسيق الصحيح.";
$lang['matches']			= "الحقل %s لايطابق الحقل %s.";
$lang['is_unique'] 			= "يجب أن يتضمن الحقل %s قيمة فريدة من نوعها.";
$lang['is_natural']			= "يجب أن يتضمن الحقل %s الأرقام الموجبة فقط.";
$lang['is_natural_no_zero']	= "يجب أن يتضمن الحقل %s عددا أكبر من الصفر.";
$lang['decimal']			= "يجب أن يتضمن الحقل %s عدد عشري.";
$lang['less_than']			= "يجب أن يحتوي الحقل %s على عدد أقل من %s.";
$lang['greater_than']		= "يجب أن يحتوي الحقل %s على عدد أكبر من %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */