<?php

$lang['required']			= "فيلد %s لازم است.";
$lang['isset']				= "فیلد %s باید مقداری داشته باشد.";
$lang['valid_email']		= "فیلد %s باید یک نشانی ایمیل معتبر را شامل باشد.";
$lang['valid_emails']		= "فیلد %s باید همه نشانی‌های ایمیل معتبر را شامل باشد.";
$lang['valid_url']			= "فیلد %s باید شامل یک نشانی وب معتبر باشد.";
$lang['valid_ip']			= "فیلد %s باید شامل یک آدرس ip معتبر باشد.";
$lang['min_length']			= "حداقل کاراکتر برای فیلد %s ، تعداد %s می باشد.";
$lang['max_length']			= "حداکثر کاراکتر برای فیلد %s ، تعداد %s می باشد.";
$lang['exact_length']		= "فیلد %s دقیقا باید تعداد %s کاراکتر داشته باشد.";
$lang['alpha']				= "فیلد %s فقط شامل حروف الفبا می باشد.";
$lang['alpha_numeric']		= "فیلد %s فقط شامل حروف الفبا و اعداد می باشد.";
$lang['alpha_dash']			= "فیلد %s فقط شامل حروف الفبا ، اعداد ، _ و - می باشد.";
$lang['numeric']			= "فیلد %s فقط شامل اعداد می باشد.";
$lang['is_numeric']			= "فیلد %s فقط شامل کاراکترهای عددی می باشد.";
$lang['integer']			= "فیلد %s فقط شامل اعداد صحیح می باشد.";
$lang['regex_match']		= "محتوای فیلد %s با فرمت درستی وارد نشده است.";
$lang['matches']			= "محتوای فیلد %s با محتوای فیلد %s همخوانی ندارد.";
$lang['is_unique'] 			= "فیلد %s باید یک مقدار منحصربه فرد داشته باشد.";
$lang['is_natural']			= "فیلد %s باید شامل اعداد مثبت باشد.";
$lang['is_natural_no_zero']	= "فیلد %s باید یک عدد بزرگتر از صفر باشد.";
$lang['decimal']			= "فیلد %s فقط شامل اعداد اعشاری می باشد.";
$lang['less_than']			= "فیلد %s باید یک عدد کوچکتر از فیلد %s باشد.";
$lang['greater_than']		= "فیلد %s باید یک عدد بزرگتر از فیلد %s باشد.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */