<?php

$lang['required']			= "Το πεδίο %s είναι υποχρεωτικό.";
$lang['isset']				= "Το πεδίο %s πρέπει να έχει μια τιμή.";
$lang['valid_email']		= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη διεύθυνση email.";
$lang['valid_emails']		= "Το πεδίο %s πρέπει να περιέχει όλες τις έγκυρες διευθύνσεις email.";
$lang['valid_url']			= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη διεύθυνση URL.";
$lang['valid_ip']			= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη IP.";
$lang['min_length']			= "Το πεδίο %s πρέπει να περιέχει τουλάχιστον %s χαρακτήρες.";
$lang['max_length']			= "Το πεδίο %s δεν μπορεί να υπερβαίνει τους %s χαρακτήρες.";
$lang['exact_length']		= "Το πεδίο %s πρέπει να αποτελείται από %s χαρακτήρες ακριβώς.";
$lang['alpha']				= "Το πεδίο %s μπορεί να περιέχει μόνο αλφαβητικούς χαρακτήρες.";
$lang['alpha_numeric']		= "Το πεδίο %s μπορεί να περιέχει μόνο αλφαριθμητικούς χαρακτήρες.";
$lang['alpha_dash']			= "Το πεδίο %s μπορεί να περιέχει μόνο αλφαριθμητικούς χαρακτήρες, παύλες και κάτω παύλες.";
$lang['numeric']			= "Το πεδίο %s πρέπει να περιέχει μόνο αριθμούς.";
$lang['is_numeric']			= "Το πεδίο %s πρέπει να περιέχουν μόνο αριθμητικούς χαρακτήρες.";
$lang['integer']			= "Το πεδίο %s πρέπει να περιέχει έναν ακέραιο αριθμό.";
$lang['regex_match']		= "Το πεδίο %s δεν είναι στη σωστή μορφή.";
$lang['matches']			= "Το πεδίο %s δεν ταιριάζει με το πεδίο %s.";
$lang['is_unique'] 			= "Το πεδίο %s πρέπει να περιέχει μια μοναδική τιμή.";
$lang['is_natural']			= "Το πεδίο %s πρέπει να περιέχει μόνο θετικούς αριθμούς.";
$lang['is_natural_no_zero']	= "Το πεδίο %s πρέπει να περιέχει αριθμό μεγαλύτερο του μηδενός.";
$lang['decimal']			= "Το πεδίο %s πρέπει να περιέχει ένα δεκαδικό αριθμό.";
$lang['less_than']			= "Το πεδίο %s πρέπει να περιέχει έναν αριθμό μικρότερο από %s.";
$lang['greater_than']		= "Το πεδίο %s πρέπει να περιέχει έναν αριθμό μεγαλύτερο του %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */